tests/vcr/tests.ouimeaux_device.test_switch/Test_F7C063.test_turn_on.yaml

interactions:
- request:
    body: '<?xml version="1.0" encoding="utf-8"?>

      <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">

      <s:Body>

      <u:SetBinaryState xmlns:u="urn:Belkin:service:basicevent:1">

      <BinaryState>1</BinaryState>

      </u:SetBinaryState>

      </s:Body>

      </s:Envelope>'
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      Content-Length:
      - '306'
      Content-Type:
      - text/xml
      SOAPACTION:
      - '"urn:Belkin:service:basicevent:1#SetBinaryState"'
      User-Agent:
      - python-requests/2.25.1
    method: POST
    uri: http://192.168.1.100:49153/upnp/control/basicevent1
  response:
    body:
      string: "<s:Envelope xmlns:s=\"http://schemas.xmlsoap.org/soap/envelope/\" s:encodingStyle=\"\
        http://schemas.xmlsoap.org/soap/encoding/\"><s:Body>\n<u:SetBinaryStateResponse\
        \ xmlns:u=\"urn:Belkin:service:basicevent:1\">\r\n<BinaryState>1</BinaryState>\r\
        \n<CountdownEndTime>0</CountdownEndTime>\r\n<deviceCurrentTime>1611389017</deviceCurrentTime>\r\
        \n</u:SetBinaryStateResponse>\r\n</s:Body> </s:Envelope>"
    headers:
      CONTENT-LENGTH:
      - '376'
      CONTENT-TYPE:
      - text/xml; charset="utf-8"
      DATE:
      - Sat, 23 Jan 2021 08:03:37 GMT
      EXT:
      - ''
      SERVER:
      - Unspecified, UPnP/1.0, Unspecified
      X-User-Agent:
      - redsonic
    status:
      code: 200
      message: OK
- request:
    body: '<?xml version="1.0" encoding="utf-8"?>

      <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">

      <s:Body>

      <u:GetBinaryState xmlns:u="urn:Belkin:service:basicevent:1">


      </u:GetBinaryState>

      </s:Body>

      </s:Envelope>'
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      Content-Length:
      - '278'
      Content-Type:
      - text/xml
      SOAPACTION:
      - '"urn:Belkin:service:basicevent:1#GetBinaryState"'
      User-Agent:
      - python-requests/2.25.1
    method: POST
    uri: http://192.168.1.100:49153/upnp/control/basicevent1
  response:
    body:
      string: "<s:Envelope xmlns:s=\"http://schemas.xmlsoap.org/soap/envelope/\" s:encodingStyle=\"\
        http://schemas.xmlsoap.org/soap/encoding/\"><s:Body>\n<u:GetBinaryStateResponse\
        \ xmlns:u=\"urn:Belkin:service:basicevent:1\">\r\n<BinaryState>1</BinaryState>\r\
        \n</u:GetBinaryStateResponse>\r\n</s:Body> </s:Envelope>"
    headers:
      CONTENT-LENGTH:
      - '285'
      CONTENT-TYPE:
      - text/xml; charset="utf-8"
      DATE:
      - Sat, 23 Jan 2021 08:03:37 GMT
      EXT:
      - ''
      SERVER:
      - Unspecified, UPnP/1.0, Unspecified
      X-User-Agent:
      - redsonic
    status:
      code: 200
      message: OK
version: 1
